In [5]:
import pandas as pd
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})

In [7]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [9]:
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [11]:
departments

   DeptID     DeptName
0      10           HR
1      20  Engineering
2      40    Marketing

In [13]:
pd.merge(employees, departments, on = "DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [17]:
pd.merge(employees, departments, how= "left")

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [23]:
pd.merge(employees, departments,on="DeptID" , how= "outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [33]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"], "score":[423,634] })
df2 = pd.DataFrame({"Name": ["Charlie", "David"], "age":[45,78]})

In [35]:
df1

    Name  score
0  Alice    423
1    Bob    634

In [37]:
df2

      Name  age
0  Charlie   45
1    David   78

In [39]:
pd.concat([df1,df2])

      Name  score   age
0    Alice  423.0   NaN
1      Bob  634.0   NaN
0  Charlie    NaN  45.0
1    David    NaN  78.0

In [43]:
pd.concat([df1,df2], axis=1)

    Name  score     Name  age
0  Alice    423  Charlie   45
1    Bob    634    David   78